import pandas as pd
import matplotlib.pyplot as plt
#对比分析单线程/进程、2线程、3线程加锁程序的10次运行时间差异，以表格或图形方式给出对比结果,
plt.rcParams['font.sans-serif'] = ['SimHei'] #用来正常显示中文标签
plt.figure(dpi=1000)
#读取数据
first_time = {"1": 0.158423, "2": 0.179183, "3": 0.217543, "4": 0.315517, "5": 0.274815, "6": 0.184218, "7": 0.104721, "2.1":0.169183, "7.1": 0.112721}
second_time = {"1": 0.136666, "2": 0.157914, "3": 0.197407, "4": 0.325517, "5": 0.260122, "6": 0.198214, "7": 0.111178, "2.1":0.141742, "7.1": 0.116178}
third_time = {"1": 0.139452, "2": 0.158423, "3": 0.199542, "4": 0.319412, "5": 0.254131, "6": 0.201711, "7": 0.125421, "2.1":0.147811, "7.1": 0.129421}
fourth_time = {"1": 0.146478, "2": 0.167207, "3": 0.204785, "4": 0.338112, "5": 0.284120, "6": 0.185422, "7": 0.114721, "2.1":0.154112, "7.1": 0.118721}
fifth_time = {"1": 0.158412, "2": 0.175204, "3": 0.207411, "4": 0.327162, "5": 0.275147, "6": 0.217898, "7": 0.125133, "2.1":0.157411, "7.1": 0.128133}
sixth_time = {"1": 0.143841, "2": 0.168410, "3": 0.217017, "4": 0.337115, "5": 0.279874, "6": 0.183412, "7": 0.106542, "2.1":0.165412, "7.1": 0.108542}
seventh_time = {"1": 0.138129, "2": 0.178425, "3": 0.204453, "4": 0.327155, "5": 0.285123, "6": 0.197254, "7": 0.124211, "2.1":0.169183, "7.1": 0.127211}
eighth_time = {"1": 0.146582, "2": 0.178429, "3": 0.221742, "4": 0.338111, "5": 0.267712, "6": 0.204156, "7": 0.114123, "2.1":0.168745, "7.1": 0.117123}
ninth_time = {"1": 0.151566, "2": 0.158796, "3": 0.204875, "4": 0.318425, "5": 0.284122, "6": 0.189874, "7": 0.101752, "2.1":0.154124, "7.1": 0.106752}
tenth_time = {"1": 0.145412, "2": 0.167812, "3": 0.217533, "4": 0.320715, "5": 0.298741, "6": 0.195254, "7": 0.103254, "2.1":0.154712, "7.1": 0.108254}
#构造数据,三种程序每次运行的时间放在一起，即一组数据为三个柱子,共10组数据
data = [[first_time['4'],first_time['5'],first_time['6'],first_time['7']], [second_time['4'],second_time['5'],second_time['6'],second_time['7']], [third_time['4'],third_time['5'],third_time['6'],third_time['7']], [fourth_time['4'],fourth_time['5'],fourth_time['6'],fourth_time['7']], [fifth_time['4'],fifth_time['5'],fifth_time['6'],fifth_time['7']], [sixth_time['4'],sixth_time['5'],sixth_time['6'],sixth_time['7']], [seventh_time['4'],seventh_time['5'],seventh_time['6'],seventh_time['7']], [eighth_time['4'],eighth_time['5'],eighth_time['6'],eighth_time['7']], [ninth_time['4'],ninth_time['5'],ninth_time['6'],ninth_time['7']], [tenth_time['4'],tenth_time['5'],tenth_time['6'],tenth_time['7']]]
#构造索引
index = ['第一次', '第二次', '第三次', '第四次', '第五次', '第六次', '第七次', '第八次', '第九次', '第十次']
#构造列名
columns = ['无cache', 'cache32', 'cache64', 'cache128']
#构造DataFrame
df = pd.DataFrame(data, index=index, columns=columns)
#绘制柱状图
df.plot(kind='bar', rot=0)
#输出柱状图，显示均价
plt.title('三线程增加cache时间对比')
plt.ylabel('运行时间/s')
plt.xlabel('运行次数')
plt.show()



